'îºäpâpêî Å® ëSäpâpêî
Function EditText(s)

	zenkaku=Array("Ç`","Ça","Çb","Çc","Çd","Çe","Çf","Çg","Çh","Çi","Çj","Çk","Çl","Çm","Çn","Ço","Çp","Çq","Çr","Çs","Çt","Çu","Çv","Çw","Çx","Çy","ÇÅ","ÇÇ","ÇÉ","ÇÑ","ÇÖ","ÇÜ","Çá","Çà","Çâ","Çä","Çã","Çå","Çç","Çé","Çè","Çê","Çë","Çí","Çì","Çî","Çï","Çñ","Çó","Çò","Çô","Çö","ÇO","ÇP","ÇQ","ÇR","ÇS","ÇT","ÇU","ÇV","ÇW","ÇX","Éí","É@","ÉB","ÉD","ÉF","ÉH","ÉÉ","ÉÖ","Éá","Éb","ÉA","ÉC","Éî","ÉE","ÉG","ÉI","ÉK","ÉJ","ÉM","ÉL","ÉO","ÉN","ÉQ","ÉP","ÉS","ÉR","ÉU","ÉT","ÉW","ÉV","ÉY","ÉX","É[","ÉZ","É]","É\","É_","É^","Éa","É`","Éd","Éc","Éf","Ée","Éh","Ég","Éi","Éj","Ék","Él","Ém","Éo","Ép","Én","Ér","És","Éq","Éu","Év","Ét","Éx","Éy","Éw","É{","É|","Éz","É}","É~","ÉÄ","ÉÅ","ÉÇ","ÉÑ","ÉÜ","Éà","Éâ","Éä","Éã","Éå","Éç","Éè","Éì","ÅC","ÅD","ÅF","ÅG","ÅH","ÅI","ÅO","ÅQ","Å^","Å`","Åb","Åe","Åf","Åh","Åi","Åj","Åm","Ån","Åo","Åp","Å{","Å|","ÅÅ","ÅÉ","ÅÑ","Åè","Åê","Åì","Åî","Åï","Åñ","Åó","ÅB","ÅA","ÅE","ÅJ","ÅK","Å[","Åu","Åv","Å@")

	hankaku=Array("A","B","C","D","E","F","G","H","I","J","K","L","M","N","O","P","Q","R","S","T","U","V","W","X","Y","Z","a","b","c","d","e","f","g","h","i","j","k","l","m","n","o","p","q","r","s","t","u","v","w","x","y","z","0","1","2","3","4","5","6","7","8","9","¶","ß","®","©","™","´","¨","≠","Æ","Ø","±","≤","≥ﬁ","≥","¥","µ","∂ﬁ","∂","∑ﬁ","∑","∏ﬁ","∏","πﬁ","π","∫ﬁ","∫","ªﬁ","ª","ºﬁ","º","Ωﬁ","Ω","æﬁ","æ","øﬁ","ø","¿ﬁ","¿","¡ﬁ","¡","¬ﬁ","¬","√ﬁ","√","ƒﬁ","ƒ","≈","∆","«","»","…"," ﬁ"," ﬂ"," ","Àﬁ","Àﬂ","À","Ãﬁ","Ãﬂ","Ã","Õﬁ","Õﬂ","Õ","Œﬁ","Œﬂ","Œ","œ","–","—","“","”","‘","’","÷","◊","ÿ","Ÿ","⁄","€","‹","›",",",".",":",";","?","!","^","_","/","~","|","`","'","""","(",")","[","]","{","}","+","-","=","<",">","\","$","%","#","&","*","@","°","§","•","ﬁ","ﬂ","∞","¢","£"," ")

	sTargetString = s
	
	For i = 0 To UBound(zenkaku)
		schPattern = hankaku(i)
		repPattern = zenkaku(i)
		sTargetString = Replace(sTargetString,schPattern,repPattern)
	Next
	EditText = sTargetString
	
	Erase zenkaku
	Erase hankaku
End Function